#include <stdio.h>
#include <windows.h>
#include <stdlib.h>

void swap(int *, int *);

void bubbleSort(int[], int);

void merge(int a[], int start, int middle, int end);

void mergeSort(int a[], int start, int end);

// น่ฟญ รโทย วิผ๖
void printArr(int value[], int n) {
    for (int i = 0; i < n; i++)
        printf("%d 8"
               "", value[i]);
    printf("\n");
}

// ผฑลร มคทฤ ฝววเ วิผ๖
void selectionSort(int *value, int n) {
    int i, j;
    int min = 0;
    int temp1 = 0; // swapฟก พฒฑโ ภงวั บฏผ๖ (ภำฝร)

    // i forนฎ :
    for (i = 0; i < n - 1; i++) {
        min = i; // ภฮตฆฝบ
        for (j = i + 1; j < n; j++) {
            if (value[min] > value[j])
                min = j;
        }

        // ฐหป็วั ฐชม฿ ฐกภๅ ภÛภบ ฐชฐ๚ value[i]ฐช swap ฐ๚มค.
        temp1 = value[i];
        value[i] = value[min];
        value[min] = temp1;
    }
}
// ผฑลรมคทฤ ฟฉฑโฑ๎ม๖


// ป๐ภิ มคทฤ
void insertion_sort(int list[], int n) {
    int i, j, key;

    // ภฮลุฝบ 0ภบ ภฬนฬ มคทฤตศ ฐอภธทฮ บผ ผ๖ ภึดู.
    for (i = 1; i < n; i++) {
        key = list[i]; // ว๖ภ็ ป๐ภิตษ ผýภฺภฮ iน๘ยฐ มคผ๖ธฆ key บฏผ๖ทฮ บนป็

        // ว๖ภ็ มคทฤตศ น่ฟญภบ i-1ฑ๎ม๖ภฬนวทฮ i-1น๘ยฐบฮลอ ฟชผ๘ภธทฮ มถป็วัดู.
        // j ฐชภบ ภฝผ๖ฐก พฦดฯพ๎พ฿ ตวฐํ
        // key ฐชบธดู มคทฤตศ น่ฟญฟก ภึดย ฐชภฬ ลฉธ้ jน๘ยฐธฆ j+1น๘ยฐทฮ ภฬตฟ
        for (j = i - 1; j >= 0 && list[j] > key; j--) {
            list[j + 1] = list[j]; // ทนฤฺตๅภว ฟภธฅยสภธทฮ ภฬตฟ
        }

        list[j + 1] = key;
    }
}
//ป๐ภิมคทฤ ฟฉฑโฑ๎ม๖

//น๖บํมคทฤ ฝววÜวิผ๖
void swap(int *num1, int *num2) {            // ผญทฮ ฑณศฏวุมึดย วิผ๖
    int temp;
    temp = *num2;
    *num2 = *num1;
    *num1 = temp;
}

void bubbleSort(int arr[], int size) {               // น๖บํมคทฤวฯดย วิผ๖
    int i, j;
    for (j = 0; j < size - 1; j++) {
//        printArr(arr, size);                       // น่ฟญภป ศญธ้ฟก รโทยวฯดย วิผ๖
        for (i = 0; i < size - j - 1; i++) {
            if (arr[i] > arr[i + 1]) {
                swap(&arr[i], &arr[i + 1]);     // ผญทฮ ฑณศฏวุมึดย วิผ๖
            }
        }
    }
//    printf("\n");
}
//น๖บํมคทฤ ฟฉฑโฑ๎ม๖ คฟคคคฑคฑ

//ฤüมคทฤ วิผ๖
void quick_sort(int *data, int start, int end) {
    if (start >= end) {
        // ฟ๘ผาฐก 1ฐณภฮ ฐๆฟ์
        return;
    }

    int pivot = start;
    int i = pivot + 1; // ฟÞยส รโน฿ ม๖มก
    int j = end; // ฟภธฅยส รโน฿ ม๖มก
    int temp;

    while (i <= j) {
        // ฦ๗ภฮลอฐก พ๙ฐฅธฑถงฑ๎ม๖ นÝบน
        while (i <= end && data[i] <= data[pivot]) {
            i++;
        }
        while (j > start && data[j] >= data[pivot]) {
            j--;
        }

        if (i > j) {
            // พ๙ฐฅธฒ
            temp = data[j];
            data[j] = data[pivot];
            data[pivot] = temp;
        } else {
            // iน๘ยฐฟอ jน๘ยฐธฆ ฝบฟา
            temp = data[i];
            data[i] = data[j];
            data[j] = temp;
        }
    }

    // บะวา ฐ่ป๊
    quick_sort(data, start, j - 1);
    quick_sort(data, j + 1, end);
}
//ฤüมคทฤ ฟฉฑโฑ๎ม๖

//วีบดมคทฤ วิผ๖
int sorted[25];

void merge(int a[], int start, int middle, int end) {

    int i, j, k; //ฐขฐข start middle middle+1 ฟก วุด็
    i = start;
    j = middle + 1;
    k = start;

    // 3ฐกม๖ภว ฐๆฟ์ม฿ฟก ฑณย๗ตวดย ฐๆฟ์ธีภ๚ต๛มฎบธภฺ
    while (i <= middle && j <= end) {


        if (a[i] <= a[j]) {
            sorted[k] = a[i];
            i++;
        } else { //ฑื นÝด๋ภว ฐๆฟ์ถ๓ธ้
            sorted[k] = a[j];
            j++;
        }
        k++;//มคทฤน่ฟญภว ดูภฝ ฤญฟก ดใพฦพ฿ วฯนวทฮ
    }

    //ฑณย๗ตวดย ฐๆฟ์ฐก พฦดฯถ๓ ฦฏมค วฯณชฐก ธีภ๚ รคฟ๖ม๘ดูธ้?
    if (i > middle) {// iฐก ธีภ๚รคฟ๖มณฑโถงนฎฟก middleบธดู ฤฟม๘ฐอ
        for (int t = j; t <= end; t++) {
            sorted[k] = a[t];
            k++;
        }
    } else { // jฐก ธีภ๚รคฟ๖มณฑโถงนฎฟก
        for (int t = i; t <= middle; t++) {
            sorted[k] = a[t];
            k++;
        }
    }
    //มคทฤตศ น่ฟญภป ป๐ภิ

    for (int t = start; t <= end; t++) {
        a[t] = sorted[t];
    }
}

void mergeSort(int a[], int start, int end) {

    if (start < end) {
        int middle;
        middle = (start + end) / 2;
        mergeSort(a, start, middle);
        mergeSort(a, middle + 1, end);//ฐ่ผำ บะวา
        merge(a, start, middle, end);

    }
}
//วีบดมคทฤ ฟฉฑโฑ๎ย๎

//ศüมคทฤ วิผ๖
//heapify, ศü ป๓ลย ธธต้ฑโ
void heapify(int *arr, int size){
    for(int i=1;i<size;++i){
        int child = i;
        do{
            //ภฺฝฤ ณ๋ตๅฐก บฮธ๐ ณ๋ตๅบธดู ลฉธ้ ฑณศฏ
            int root = (child-1)/2;
            if(arr[root]<arr[child]){
                int temp = arr[root];
                arr[root] = arr[child];
                arr[child] = temp;
            }
            child = root;
        }while(child!=0);	//รึป๓ดÜ ณ๋ตๅฑ๎ม๖ มกฐห
    }
}

//รึป๓ดÜ ณ๋ตๅฟอ รึวฯดÜ ณ๋ตๅ ฑณรผ
void heap(int *arr, int *size){
    int temp = arr[0];
    arr[0] = arr[*size-1];
    arr[*size-1] = temp;
    --(*size);
}

int main() {
    system("mode con cols=230 lines=30");
    //cols = ฤญ/วเ (ฐกทฮ)  lines = มู/ฟญ (ผผทฮ)
    a:
    printf("กเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเ\n"
           "กเกแกแกแกแกแกแกเกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกเกเกเกแกแกแกแกแกแกเกแกเกเกเกแกแกแกแกแกเกเกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกแกแกแกแกเกแกเกแกเกเ\n"
           "กเกเกเกแกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกแกเกเกเกเกเกเกเกแกแกแกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกแกเกแกเกแกเกเ\n"
           "กเกเกเกแกเกเกเกเกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกแกเกแกเกเกเกเกเกเกเกเกเกเกเกแกแกเกแกแกแกเกเกเกแกแกแกแกแกเกเกแกเกเกเกเกเกแกเกเกเกแกเกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกเกเกเกเกเกเกแกเกเกเกแกแกแกแกเกแกแกแกเกเ\n"
           "กเกเกเกแกเกเกเกเกแกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกแกเกเกเกแกเกเกเกเกเกเกเกเกเกแกเกเกแกเกเกแกเกเกเกแกเกเกเกเกแกแกแกเกเกเกเกเกแกเกเกเกแกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกแกเกเกเกเกแกเกแกเกเ\n"
           "กเกเกแกเกแกเกเกเกแกแกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกแกแกเกเกเกเกเกแกแกเกเกเกเกเกเกแกเกเกเกเกแกเกแกเกเกเกแกแกแกแกแกแกเกแกเกเกเกเกเกแกเกเกเกแกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกแกเกเกเกเกแกเกแกเกเ\n"
           "กเกเกแกเกแกเกเกเกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกแกแกแกแกแกแกแกแกแกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกเกเกเกเกเกเกแกเกเกเกแกแกแกแกเกแกเกแกเกเ\n"
           "กเกเกแกเกเกแกเกเกแกเกเกเกเกเกแกเกเกเกแกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกแกแกแกแกแกเกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกเ\n"
           "กเกแกเกเกเกแกเกเกแกเกเกเกเกเกแกเกเกเกแกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกแกเกเกเกเกเกเกเกเกแกแกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกแกแกแกแกแกแกแกเกเ\n"
           "กเกแกเกเกเกเกแกเกแกเกเกเกแกแกแกแกแกแกแกแกแกเกเกเกเกเกเกแกเกเกเกเกเกเกแกแกแกแกแกแกแกแกแกเกเกเกเกเกเกเกแกเกเกเกเกเกแกเกเกเกเกแกแกแกเกเกเกเกเกเกเกแกแกแกแกแกแกแกแกแกเกเกแกแกแกแกแกแกแกแกแกเกเกแกแกแกแกแกแกแกแกแกเกเกเกแกเกเกเกเกเกแกเกเ\n"
           "กเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกแกแกแกแกเกเกเกเกเกแกแกแกแกแกแกแกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกแกแกแกแกแกแกแกเกเ\n"
           "กเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเกเ");

    int input = 0;
    printf("      [] 1. ผฑลรมคทฤ\n"
           "    [] 2. ป๐ภิมคทฤ\n"
           "    [] 3. น๖บํมคทฤ\n"
           "    [] 4. ฤüมคทฤ\n"
           "    [] 5. วีบดมคทฤ\n"
           "    [] 6. ศüมคทฤ\n"
           "    [] 7. มพทแ\n");
    rego:
    printf("\n");
    printf("ผýภฺธฆ ภิทยวฯผผฟไ");


    printf("น๘ศฃ ภิทย : ");
    if (!scanf("%d", &input)) {
        printf("ผýภฺฐก พฦดัตชผ๎..??\n");
        Sleep(1000);
        printf("ปัปัทฏยแยษคณภฏคนคครÝปิ[คคท๏ฑธควทกครคธคพคทคฝ ฟภท๙ ฟภท๙ ฟภท๙ !!!\nฟนป๓ฤก ธ๘วั ฟภท๙ทฮ วมทฮฑืทฅภป มพทแวีดฯดู...");
        Sleep(5000);
        return 0;
    }
    c:
    switch (input) {
        case 1:
            printf("\nผฑลรมคทฤภป ผฑลรวฯผฬฝภดฯดู\n");
            int value[25];

            printf("\n");
            printf("ปýผบตศ ทฃดýฐช : ");
            for (int i = 0; i < 25; i++) { // 25น๘ นÝบน
                value[i] = rand() % 99 + 1; // ณญผ๖ ปýผบ

                printf("%d  ", value[i]); // รโทย
            }
            // มคทฤ รโทยวฯดย ธํทษพ๎ คพศ๗ฦRคต
            printf("\n\n\n");
            printf("มคทฤ ภü : ");
            printArr(value, 25);
            selectionSort(value, 25);
            printf("มคทฤ ศฤ : ");
            printArr(value, 25);
            printf("\n\n");
            goto rego;
            break;

        case 2:
            printf("\nป๐ภิมคทฤภป ผฑลรวฯผฬฝภดฯดู\n");
            int i;
            int list[25];

            printf("\n");
            printf("ปýผบตศ ทฃดýฐช : ");
            for (int i = 0; i < 25; i++) { // 25น๘ นÝบน
                list[i] = rand() % 99 + 1; // ณญผ๖ ปýผบ

                printf("%d  ", list[i]); // รโทย
            }
            printf("\n\n\n\n");
//            int n2 = MAX_SIZE;
//            int list[25] = {8, 5, 6, 2, 4, 5, 23, 3,32 ,35,235,235, 25,53,2,243, 5,62,3235, 523,2,23 ,5,8,5};
            // มคทฤ ภü ฐแฐ๚ รโทย
            printf("มคทฤ ภü : ");
            for (i = 0; i < 25; i++) {
                printf("%d ", list[i]);
            }
            printf("\n");
            // ป๐ภิ มคทฤ ผ๖วเ
            insertion_sort(list, 25);

            // มคทฤ ฐแฐ๚ รโทย
            printf("มคทฤ ศฤ : ");
            for (i = 0; i < 25; i++) {
                printf("%d ", list[i]);
            }
            printf("\n\n");
            goto rego;
            break;

        case 3:
            printf("\nน๖บํมคทฤภป ผฑลรวฯผฬฝภดฯดู\n");
            int array[25];
            printf("\n");
            printf("ปýผบตศ ทฃดýฐช : ");
            for (int i = 0; i < 25; i++) { // 25น๘ นÝบน
                array[i] = rand() % 99 + 1; // ณญผ๖ ปýผบ

                printf("%d  ", array[i]); // รโทย
            }
            printf("\n\n\n\n");
            printf("มคทฤ ภü: ");
            printArr(array, 25);
            bubbleSort(array, 25); // น๖บํมคทฤ วิผ๖
            printf("มคทฤ ศฤ : ");
            printArr(array, 25);
            printf("\n\n");
            goto rego;
            break;

        case 4:
            printf("\nฤüมคทฤภป ผฑลรวฯผฬฝภดฯดู\n");
            int data[25];
            printf("\n");
            printf("ปýผบตศ ทฃดýฐช : ");
            for (int i = 0; i < 25; i++) { // 25น๘ นÝบน
                data[i] = rand() % 99 + 1; // ณญผ๖ ปýผบ

                printf("%d  ", data[i]); // รโทย
            }
            printf("\n\n\n\n");
            printf("มคทฤ ภü: ");
            // มคทฤ ภü ฐแฐ๚ ศฎภฮ
            for (int i = 0; i < 25; i++) {
                printf("%d ", data[i]);
            }
            quick_sort(data, 0, 24);
            printf("\n");
            printf("มคทฤ ศฤ : ");
            // ฐแฐ๚ ศฎภฮ
            for (int i = 0; i < 25; i++) {
                printf("%d ", data[i]);
            }
            printf("\n\n");
            goto rego;
            break;

        case 5:
            printf("\nวีบดมคทฤภป ผฑลรวฯผฬฝภดฯดู\n");
            printf("\n");
            int marray[25];
            printf("ปýผบตศ ทฃดýฐช : ");
            for (int i = 0; i < 25; i++) { // 25น๘ นÝบน
                marray[i] = rand() % 99 + 1; // ณญผ๖ ปýผบ

                printf("%d  ", marray[i]); // รโทย
            }
            printf("\n\n\n\n");
            printf("มคทฤ ภü: ");
            // มคทฤ ภü ฐแฐ๚ ศฎภฮ
            for (int i = 0; i < 25; i++) {
                printf("%d ", marray[i]);
            }
            mergeSort(marray, 0, 24);
            printf("\n");
            printf("มคทฤ ภü: ");
            for (int i = 0; i < 25; i++) {
                printf("%d ", marray[i]);
            }
            printf("\n\n");
            goto rego;
            break;

        case 6:
            printf("\nศüมคทฤภป ผฑลรวฯผฬฝภดฯดู\n");
            //นซภÛภง น่ฟญ
            int size = 25;
            printf("\n");
            int heaparr[25];
            printf("ปýผบตศ ทฃดýฐช : ");
            for (int i = 0; i < 25; i++) { // 25น๘ นÝบน
                heaparr[i] = rand() % 99 + 1; // ณญผ๖ ปýผบ

                printf("%d  ", heaparr[i]); // รโทย
            }
            printf("\n\n\n\n");
            printf("มคทฤ ภü: ");
            for(int i=0;i<25;++i){
                printf("%d ", heaparr[i]);
            }
            //ศüมคทฤ
            for(int i=0;i<25;++i){
                heapify(heaparr, size);
                heap(heaparr, &size);
            }
            printf("\n");
            //รโทย
            printf("มคทฤ ภü: ");
            for(int i=0;i<25;++i){
                printf("%d ", heaparr[i]);
            }
            printf("\n\n");
            goto rego;
            break;
        case 7:
            return 0;
            break;

        default: //else
            printf("ภ฿ธ๘ตศ น๘ศฃ ภิทย...");
            Sleep(1000);
            system("cls");
            goto a;
            break;
    }

    Sleep(30000);
}

//
//    int value[] = { 4, 7, 9, 11, 3, 7, 6 };
//    int n = sizeof(value) / sizeof(int); // น่ฟญภว ฑๆภฬ